tutorials/oneD_freely_propagating_flame/temp/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
500
(
(1.62812e-05 0.00092359 0.00092359)
(4.88437e-05 0.00092359 0.00092359)
(8.14062e-05 0.00092359 0.00092359)
(0.000113969 0.00092359 0.00092359)
(0.000146531 0.00092359 0.00092359)
(0.000179094 0.00092359 0.00092359)
(0.000211656 0.00092359 0.00092359)
(0.000244219 0.00092359 0.00092359)
...
)
;

boundaryField
{
    boundary
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0.00092359 0.00092359);
    }
    outlet
    {
        type            calculated;
        value           uniform (0.0184718 0.00092359 0.00092359);
    }
}


// ************************************************************************* //
