tutorials/oneD_freely_propagating_flame/temp/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
500
(
0.00092359
0.00092359
0.00092359
0.00092359
0.00092359
0.00092359
0.00092359
0.00092359
...
)
;

boundaryField
{
    boundary
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.00092359;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.00092359;
    }
}


// ************************************************************************* //
