tutorials/oneD_freely_propagating_flame/temp/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version          2.0;
    format           ascii;
    class            dictionary;
    location         "constant";
    object           CanteraTorchProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/sampleConfigDict"

chemistry                   on;

CanteraMechanismFile        $CanteraMechanismFile_;

transportModel              "Mix";

odeCoeffs
{
    "relTol"                1e-6;
    "absTol"                1e-10;
}

inertSpecie                 $inertSpecie_;

splittingStrategy           off;

TorchSettings
{
    torch                   $torch_;
    GPU                     $GPU_;
    log                     $log_;
    torchModel              $torchModel_; 
    frozenTemperature       $frozenTemperature_;
    inferenceDeltaTime      $inferenceDeltaTime_;
    coresPerNode            $coresPerNode_;
}

loadbalancing
{
    active                  true;
    log                     false;
    algorithm               allAverage;//headTail;
}


// ************************************************************************* //
