tutorials/oneD_freely_propagating_flame/temp/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "sampleConfigDict"

// convertToMeters 0.001;

W   $domainWidth;
L   $domainLength;

vertices
(
    ( 0 $W $W)
    ($L $W $W)
    ($L $W  0)
    ( 0 $W  0)
    ( 0  0 $W)
    ($L  0 $W)
    ($L  0  0)
    ( 0  0  0)
);

blocks
(
    hex (4 5 6 7 0 1 2 3) (500 1 1)
    simpleGrading
    (
        (
            (0.55 0.625 1)
            (0.45 0.375 2)
        )
        1
        1
    )
);

edges
(
);

boundary
(
    boundary
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 1 5 4)
            (3 2 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
);

// mergePatchPairs
// (
// );

// ************************************************************************* //
